{"events":[{"title":"Fiesta de San Isidro: Madrid’s largest traditional festival ","image":"https://expatexplore.com/blog/wp-content/uploads/2017/01/Madrid_Spain_Festivale_ExpatExplore.jpg","date":"2023-05-15","description":"The Fiesta de San Isidro in Spain commemorates the patron saint of Madrid, San Isidro. It’s the highlight of the city’s springtime calendar. Each year, the festival starts with a procession of giants and cabezudos (giants and bigheads). Then, an opening speech in the Plaza Mayor. Over the next few days, the city becomes a festive riot of Latin culture! 50+ music, theatre and dance concerts take place in indoor venues and alfresco locations throughout the Spanish capital.","id":"99683332-2e18-4078-9e3a-1091b7b0c1a0"},{"title":"Chelsea Flower Show: Englands’s horticultural showcase ","image":"https://expatexplore.com/blog/wp-content/uploads/2017/01/ExpatExplore_Chelsea_Flower_Show.jpg","date":"2023-05-22","description":"The RHS Chelsea Flower Show, also known as the ‘Great Spring Show’, is a large scale flower and landscaping expo. Gardening enthusiasts travel from around the globe for this five-day event in the United Kingdom. What are the highlights of the event? Many show gardens are designed by the UK’s best landscaping artists. These include avant-garde pieces that would be at home around futuristic structures or historic castles. Some even show how to garden if you have very little space – that could be useful!","id":"4809c22f-cf21-4f23-8aed-8ea49d0f15ca"},{"title":"King’s Day: An all-day citywide street festival ","image":"https://expatexplore.com/blog/wp-content/uploads/2017/01/Kings_day_Amsterdam_Events_.jpg","date":"2023-04-27","description":"\n\n    2 December 2022\n\nGather round ladies and gentlemen! What better way to experience a country than by taking part in one of its exciting festive events? Europe is home to a number of countries; each with its own unique mix of languages, traditions and cultural events. From the green-tinted revelry of St. Patrick’s Day in Ireland to the famous Carnival of Venice, attending one of the annual Europe events below is sure to be some of the most fun you can have during a European trip!\n\nPlanning to travel abroad in the coming year? Excellent! That means you have plenty of time to tailor your trip to include a few of the famous European festivals. Expat Explore has put together our top 18 picks of annual Europe events in 2023:\n1. Carnival of Venice: The floating city’s masked fete\n\nLocation: Venice, Italy\n\n4 February – 21 February 2023\nVenice Carnival, Europe Events 2022\nDelight in the magic of the Venice Carnival in 2023!\n\nThe Carnival of Venice takes place each year, just before the six-week Catholic religious observance of Lent. Locals and visitors can dress up, wear masks and parade fabulous costumes. What can you look forward to? Street parades, theatrical events, masked balls and shows on the city’s famous waterways to name a few!\n2. Vinterjazz: A 3-week-long musical feast \n\nLocation: Copenhagen, Denmark\n\n2 – 26 February 2023\nVinterjazz, Copenhagen, Europe Events 2022\nVinterjazz is a must-attend event for jazz and music lovers.\n\nVinterjazz is a must on the Denmark music calendar. Imagine 600+ concerts, 100+ venues and 25 independent organisers throughout the country. It’s no wonder the festival draws countless guests from far and wide! It’s the ideal opportunity to enjoy live jazz in the historical streets of Copenhagen. The city has been known as one of the jazz capitals of Europe since the 1950s, so these musicians are the best of the best!\n\nRelated: Here’s how to spend 24 hours in Copenhagen!\n3. St Patrick’s Day: The feast of Saint Patrick \n\nLocation: Ireland\n\n17 March 2023 \nSt. Patrick’s Day, Europe Events 2022\nDon your best green attire and join in the St. Paddy’s festivities!\n\nSt Patrick’s Day is an official Irish holiday. It celebrates the passing of the patron saint of Ireland. Today, St. Paddy’s is now celebrated by many countries! What will you see? A lot of shamrocks, leprechauns and green-tinged beer. In the capital city Dublin, the festival takes on a whole new meaning. Here, Lá Fhéile Pádraig (St Patrick’s Day in Irish), means parades, concerts and even treasure hunts!\n\nRelated: Celebrate St. Patrick’s Day with these traditional Irish recipes.\n4. Keukenhof: A colourful Tulip & Flower Festival \n\nLocation: Amsterdam, the Netherlands\n\n23 March – 14 May 2023\nkeukenhof_netherlands\nThe Netherlands is famous for its tulips.\n\nKeukenhof is also known as the ‘Garden of Europe’. In the space of eight weeks, more than 500 flower growers and bulb purveyors show off what they have in Amsterdam! The Keukenhof garden dates back to the 15th century. It was previously known as the gardens of the Countess Jacqueline of Bavaria. Today it is over 200 hectares and hosts the annual tulip festival. Are you a flower enthusiast? This is a bucket-list event for you!\n5. King’s Day: An all-day citywide street festival\n\nLocation: Amsterdam, the Netherlands\n\n27 April 2023\nKing’s Day, Amsterdam, Europe Events 2022\nA full day of festivities guarantees plenty of fun on King’s Day!\n\nA day-long festival in the capital of the Netherlands, King’s Day celebrates the birthday of King Willem-Alexander. Locals, expats and tourists dress in orange from head to toe to honour the Dutch royal family. The family visits a different municipality or town each year. Between 600,000 to a million people head to Amsterdam for King’s Day each year! The events usually start the night before King’s Day (King’s Night) and continue until the eve of King’s Day. The canals are full of different coloured boats (with parties onboard) all day or even week long. You can make your pick from at least eight King’s Day dance parties in the city centre of Amsterdam! King’s Day also hosts the biggest flea markets in the world.","id":"f1f70774-19b7-44e7-bc37-9cfb60d6a93f"}],"users":[{"email":"hosseinxshayesteh@gmail.com","password":"$2a$12$6NO04Dp2KIszunkYXpPAR.DvFPvIce9S3Qn2FO9KLK0skeITpCQwa","id":"3542e1c8-2aae-4ef5-b70e-ad0ca6d340d6"},{"email":"test@test.ir","password":"$2a$12$APFuxuWq3OBYpiIl8K9q.euCKGxFdelhl7SrkvndIrRVaFoEVp.nW","id":"2780b196-4971-4b2a-bc8e-30c8f495453c"}]}